{"<s>":0,"<pad>":1,"</s>":2,"<unk>":3,"<mask>":4,"!":5,"\"":6,"#":7,"$":8,"%":9,"&":10,"'":11,"(":12,")":13,"*":14,"+":15,",":16,"-":17,".":18,"/":19,"0":20,"1":21,"2":22,"3":23,"4":24,"5":25,"6":26,"7":27,"8":28,"9":29,":":30,";":31,"<":32,"=":33,">":34,"?":35,"@":36,"A":37,"B":38,"C":39,"D":40,"E":41,"F":42,"G":43,"H":44,"I":45,"J":46,"K":47,"L":48,"M":49,"N":50,"O":51,"P":52,"Q":53,"R":54,"S":55,"T":56,"U":57,"V":58,"W":59,"X":60,"Y":61,"Z":62,"[":63,"\\":64,"]":65,"^":66,"_":67,"`":68,"a":69,"b":70,"c":71,"d":72,"e":73,"f":74,"g":75,"h":76,"i":77,"j":78,"k":79,"l":80,"m":81,"n":82,"o":83,"p":84,"q":85,"r":86,"s":87,"t":88,"u":89,"v":90,"w":91,"x":92,"y":93,"z":94,"{":95,"|":96,"}":97,"~":98,"¡":99,"¢":100,"£":101,"¤":102,"¥":103,"¦":104,"§":105,"¨":106,"©":107,"ª":108,"«":109,"¬":110,"®":111,"¯":112,"°":113,"±":114,"²":115,"³":116,"´":117,"µ":118,"¶":119,"·":120,"¸":121,"¹":122,"º":123,"»":124,"¼":125,"½":126,"¾":127,"¿":128,"À":129,"Á":130,"Â":131,"Ã":132,"Ä":133,"Å":134,"Æ":135,"Ç":136,"È":137,"É":138,"Ê":139,"Ë":140,"Ì":141,"Í":142,"Î":143,"Ï":144,"Ð":145,"Ñ":146,"Ò":147,"Ó":148,"Ô":149,"Õ":150,"Ö":151,"×":152,"Ø":153,"Ù":154,"Ú":155,"Û":156,"Ü":157,"Ý":158,"Þ":159,"ß":160,"à":161,"á":162,"â":163,"ã":164,"ä":165,"å":166,"æ":167,"ç":168,"è":169,"é":170,"ê":171,"ë":172,"ì":173,"í":174,"î":175,"ï":176,"ð":177,"ñ":178,"ò":179,"ó":180,"ô":181,"õ":182,"ö":183,"÷":184,"ø":185,"ù":186,"ú":187,"û":188,"ü":189,"ý":190,"þ":191,"ÿ":192,"Ā":193,"ā":194,"Ă":195,"ă":196,"Ą":197,"ą":198,"Ć":199,"ć":200,"Ĉ":201,"ĉ":202,"Ċ":203,"ċ":204,"Č":205,"č":206,"Ď":207,"ď":208,"Đ":209,"đ":210,"Ē":211,"ē":212,"Ĕ":213,"ĕ":214,"Ė":215,"ė":216,"Ę":217,"ę":218,"Ě":219,"ě":220,"Ĝ":221,"ĝ":222,"Ğ":223,"ğ":224,"Ġ":225,"ġ":226,"Ģ":227,"ģ":228,"Ĥ":229,"ĥ":230,"Ħ":231,"ħ":232,"Ĩ":233,"ĩ":234,"Ī":235,"ī":236,"Ĭ":237,"ĭ":238,"Į":239,"į":240,"İ":241,"ı":242,"Ĳ":243,"ĳ":244,"Ĵ":245,"ĵ":246,"Ķ":247,"ķ":248,"ĸ":249,"Ĺ":250,"ĺ":251,"Ļ":252,"ļ":253,"Ľ":254,"ľ":255,"Ŀ":256,"ŀ":257,"Ł":258,"ł":259,"Ń":260,"Ġa":261,"Ġat":262,"om":263,"Ġm":264,"ic":265,"Ġatom":266,"ll":267,"oy":268,"lloy":269,"Ġo":270,"ng":271,"as":272,"Ġ1":273,"Ġatomic":274,"te":275,"si":276,"Ġof":277,"re":278,"en":279,"um":280,"Ġi":281,"th":282,"el":283,"st":284,"ty":285,"Alloy":286,"Pa":287,"ul":288,"sity":289,"ensity":290,"Ġ2":291,"ure":292,"er":293,"ru":294,"ture":295,"cture":296,"stru":297,"structure":298,"ro":299,"Mo":300,"Ġg":301,"'s":302,"cm":303,"us":304,"Ġalloy":305,"ĠMo":306,"Ġc":307,"Ġh":308,"Ġis":309,"num":310,"ung":311,"CC":312,"ĠD":313,"GPa":314,"Yo":315,"ber":316,"dul":317,"ts":318,"Â°":319,"Â³":320,"âī":321,"Ġu":322,"Ġnum":323,"ĠGPa":324,"ĠYo":325,"Ġâī":326,"Ġmas":327,"Ġmel":328,"Ġatoms":329,"ĠModul":330,"Ġhas":331,"ĠDensity":332,"Ġnumber":333,"ĠYoung":334,"ĠâīĪ":335,"Ġmass":336,"Ġmelts":337,"ĠModulus":338,"Ġth":339,"or":340,"ĠC":341,"ing":342,"al":343,"es":344,"Ġthe":345,"Ġf":346,"Ġte":347,"BCC":348,"ĠBCC":349,"Ġfor":350,"Ġstructure":351,"ted":352,"icro":353,"icrostructure":354,"ter":355,"Ġ4":356,"Ġin":357,"an":358,"Ġd":359,"ium":360,"Ġ7":361,"ĠT":362,"ĠF":363,"Ġme":364,"ĠH":365,"Ġ8":366,"nd":367,"Ġand":368,"ed":369,"Ġe":370,"ne":371,"sted":372,"Ġw":373,"Ġone":374,"ula":375,"Ġtested":376,"Ġdensity":377,"ch":378,"Ġmicrostructure":379,"68":380,"ĠN":381,"on":382,"Ġ5":383,"Ġp":384,"ĠFCC":385,"Ġs":386,"CP":387,"ĠHCP":388,"li":389,"91":390,"ach":391,"to":392,"95":393,"Ġform":394,"Ġeach":395,"ra":396,"00":397,"ĠTi":398,"ces":399,"tre":400,"roces":401,"Ġ6":402,"ĠNb":403,"Ġ0":404,"Ġ10":405,"ater":406,"ial":407,"Ġmater":408,"Ġmaterial":409,"90":410,"Ġto":411,"Ġ16":412,"ĠS":413,"ub":414,"Ġcub":415,"Ġas":416,"%.":417,"At":418,"Cal":419,"MPa":420,"Microstructure":421,"Proces":422,"Th":423,"YS":424,"Yi":425,"ck":426,"cula":427,"ith":428,"ner":429,"od":430,"rra":431,"čĊ":432,"Ġ(":433,"Ġ~":434,"ĠPa":435,"Ġarra":436,"oms":437,"ngth":438,"nged":439,"sing":440,"sius":441,"enter":442,"thod":443,"eld":444,"elsius":445,"Ġcor":446,"Ġcenter":447,"ĠCelsius":448,"Ġtest":449,"Ġmethod":450,"Ġwas":451,"Ġwith":452,"Ġformula":453,"trength":454,"ĠStrength":455,"Ġcube":456,"Atoms":457,"Calcula":458,"Processing":459,"The":460,"Yield":461,"cking":462,"ĠPacking":463,"Ġarranged":464,"Ġcorner":465,"Calculated":466,"ap":467,"hap":468,"11":469,"87":470,"ol":471,"Ġ3":472,"Ġ24":473,"Ġ26":474,"Ġ22":475,"ob":476,"22":477,"ci":478,"eci":479,"peci":480,"Ġ18":481,"tal":482,"at":483,"ĠTa":484,"Ġ9":485,"Ġ200":486,"Ġ32":487,"Ġ14":488,"Al":489,"all":490,"ĠZ":491,"Ġ11":492,"33":493,"Ġshap":494,"52":495,"las":496,"Ġor":497,"ĠNi":498,"Ġplas":499,"Ġmaterials":500,"Ġshapes":501,"ĠZr":502,"ĠCr":503,"Ġ25":504,"per":505,"Ġ13":506,"Ġ58":507,"Ġ27":508,"Ġthan":509,"57":510,"ĠFe":511,"Ġ211":512,"ĠCo":513,"Ġ47":514,"54":515,"ly":516,"Ġcon":517,"Ġ116":518,"Ti":519,"tan":520,"Ġ1668":521,"Titan":522,"Titanium":523,"ĠU":524,"sed":525,"old":526,"ĠUsed":527,"Ġ41":528,"Ġ105":529,"Ġ92":530,"Ni":531,"Ġ2468":532,"obium":533,"Niobium":534,"ĠHf":535,"Ġ12":536,"ce":537,"ĠAl":538,"ti":539,"ĠW":540,"roll":541,"Ġalloys":542,"Ġpro":543,"Ġpo":544,"fic":545,"ical":546,"anical":547,"Ġmech":548,"Ġspeci":549,"perti":550,"Ġproperti":551,"Ġmechanical":552,"Ġspecific":553,"Ġproperties":554,"omp":555,"Ġcomp":556,"96":557,"ĠV":558,"ex":559,"iq":560,"ke":561,"lex":562,"oli":563,"Ġli":564,"Ġcomplex":565,"iqu":566,"olid":567,"Ġlike":568,"55":569,"AS":570,"Liqu":571,"ay":572,"cre":573,"fy":574,"id":575,"ify":576,"lay":577,"ox":578,"pox":579,"ting":580,"Ġes":581,"Ġmold":582,"asting":583,"ured":584,"Ġclay":585,"Ġcasting":586,"ĠCAS":587,"Ġinto":588,"Ġmetal":589,"Ġepox":590,"Ġsolid":591,"peciall":592,"Ġplaster":593,"Ġconcre":594,"Ġpoured":595,"Liquid":596,"ifying":597,"Ġespeciall":598,"ĠCAST":599,"Ġmetals":600,"Ġepoxy":601,"Ġsolidifying":602,"Ġconcrete":603,"Ġespecially":604,"69":605,"65":606,"98":607,"Ġ73":608,"Ġ180":609,"Tan":610,"talum":611,"Ġ3290":612,"Tantalum":613,"85":614,"Ġ28":615,"23":616,"94":617,"Ġ40":618,"Zi":619,"Ġ1455":620,"19":621,"Nic":622,"kel":623,"Ġ91":624,"Ġ95":625,"Ġ15":626,"Ġ42":627,"Ġ88":628,"Nickel":629,"con":630,"rcon":631,"Ġ51":632,"Ġ1852":633,"Zircon":634,"Zirconium":635,"eat":636,"ve":637,"Ġ190":638,"996":639,"Ch":640,"bd":641,"rom":642,"enum":643,"Moly":644,"Ġ2623":645,"Ġ329":646,"Ġ279":647,"Ġ1907":648,"Chrom":649,"bdenum":650,"Molybdenum":651,"Chromium":652,"38":653,"74":654,"Ġ55":655,"93":656,"ace":657,"Ġface":658,"Ġ1538":659,"Iro":660,"Iron":661,"78":662,"Cob":663,"alt":664,"Ġ1495":665,"Cobalt":666,"25":667,"tall":668,"Ġmetall":669,"ati":670,"ĠM":671,"Ġ72":672,"31":673,"zes":674,"Ġsi":675,"Ġmetallic":676,"ation":677,"49":678,"Ġ178":679,"Ġ78":680,"Ha":681,"fn":682,"Ġ2233":683,"ĠMn":684,"Hafn":685,"Hafnium":686,"GH":687,"OU":688,"ROU":689,"Shap":690,"cl":691,"ding":692,"ef":693,"gh":694,"ging":695,"mon":696,"mation":697,"pp":698,"tic":699,"tru":700,"uding":701,"ugh":702,"wing":703,"xtru":704,"Ġroll":705,"Ġapp":706,"ommon":707,"sion":708,"rough":709,"Ġthrough":710,"ormation":711,"ĠCommon":712,"Ġforging":713,"Ġincl":714,"Ġdra":715,"Ġdef":716,"Ġextru":717,"lied":718,"Ġplastic":719,"ĠWROU":720,"Ġsizes":721,"GHT":722,"Shaping":723,"Ġrolling":724,"Ġapplied":725,"ĠCommonly":726,"Ġincluding":727,"Ġdrawing":728,"Ġdeformation":729,"Ġextrusion":730,"ĠWROUGHT":731,"60":732,"70":733,"Ġ23":734,"Ġ70":735,"inum":736,"uminum":737,"Ġ660":738,"Aluminum":739,"Ġ50":740,"Ġ128":741,"Van":742,"ad":743,"Ġ191":744,"Vanad":745,"Ġ1910":746,"Vanadium":747,"67":748,"troll":749,"lity":750,"Ġcontroll":751,"Ġcontrolled":752,"AL":753,"AN":754,"EAL":755,"Heat":756,"In":757,"NEAL":758,"ab":759,"ature":760,"eve":761,"han":762,"in":763,"ility":764,"lter":765,"mp":766,"men":767,"mper":768,"ool":769,"ss":770,"ves":771,"vol":772,"Ġre":773,"Ġen":774,"Ġst":775,"Ġtre":776,"ĠAN":777,"ĠIn":778,"Ġalter":779,"Ġmach":780,"ress":781,"Ġimp":782,"rove":783,"Ġcool":784,"Ġhold":785,"Ġheat":786,"Ġtemper":787,"Ġproces":788,"lieve":789,"atmen":790,"ability":791,"hance":792,"inability":793,"volves":794,"Ġrelieve":795,"Ġenhance":796,"Ġstress":797,"Ġtreatmen":798,"ĠANNEAL":799,"ĠInvolves":800,"Ġmachinability":801,"Ġimprove":802,"Ġcooling":803,"Ġholding":804,"Ġheating":805,"Ġtemperature":806,"Ġprocess":807,"Ġstresses":808,"Ġtreatment":809,"667":810,"14":811,"333":812,"Ġ54":813,"46":814,"21":815,"Ma":816,"Ġ1246":817,"ngan":818,"Ġ198":819,"ese":820,"Mangan":821,"Manganese":822,"ĠCu":823,"ER":824,"ĠO":825,"Ġ100":826,"HER":827,"THER":828,"ĠOTHER":829,"Ġ19":830,"Ġ74":831,"Ġ411":832,"Ġ183":833,"422":834,"84":835,"Tung":836,"ste":837,"Ġ3422":838,"Tungste":839,"Tungsten":840,"Ġ130":841,"Ġ1000":842,"17":843,"833":844,"Ġ800":845,"Ġ63":846,"Ġ29":847,"Co":848,"pper":849,"Ġ1085":850,"Copper":851,"Ġ1200":852,"77":853,"077":854,"86":855,"88":856,"29":857,"286":858,"714":859,"Ġ600":860,"417":861,"75":862,"167":863,"Ġ-":864,"ĠSi":865,"571":866,"15":867,"278":868,"222":869,"694":870,"143":871,"176":872,"20":873,"588":874,"10":875,"41":876,"50":877,"der":878,"wder":879,"tion":880,"Ġpowder":881,"09":882,"429":883,"769":884,"43":885,"Ġ20":886,"214":887,"929":888,"ĠZn":889,"26":890,"30":891,"Si":892,"am":893,"iam":894,"lic":895,"ond":896,"ĠDiam":897,"Ġcubic":898,"Ġ1414":899,"Silic":900,"ĠDiamond":901,"Silicon":902,"ction":903,"du":904,"ers":905,"578":906,"231":907,"416":908,"duction":909,"73":910,"Ġ700":911,"Ġ65":912,"Ġ30":913,"Ġ300":914,"12":915,"343":916,"40":917,"Ġ400":918,"Ġ96":919,"Ġ1100":920,"ĠMg":921,"889":922,"196":923,"80":924,"Ġ419":925,"133":926,"45":927,"53":928,"533":929,"514":930,"62":931,"nc":932,"Ġ111":933,"Ġ1400":934,"Zinc":935,"72":936,"DER":937,"OW":938,"Pro":939,"POW":940,"et":941,"eom":942,"ff":943,"gy":944,"ies":945,"nter":946,"niqu":947,"osi":948,"rgy":949,"ries":950,"solid":951,"urgy":952,"vers":953,"ĠPOW":954,"Ġvers":955,"Ġ210":956,"Ġgeom":957,"Ġtech":958,"Ġ45":959,"lizes":960,"Ġ60":961,"Ġ650":962,"Ġ1600":963,"Ġ110":964,"Ġshaping":965,"Ġconsolid":966,"ĠUti":967,"Ġproduction":968,"Ġcomposi":969,"Ġmetallurgy":970,"atility":971,"Ġsinter":972,"ĠOff":973,"Ġpowders":974,"Production":975,"etries":976,"niques":977,"ĠPOWDER":978,"Ġversatility":979,"Ġgeometries":980,"Ġtechniques":981,"Ġconsolidation":982,"ĠUtilizes":983,"Ġcomposition":984,"Ġsintering":985,"ĠOffers":986,"03":987,"268":988,"34":989,"42":990,"657":991,"71":992,"787":993,"92":994,"933":995,"gne":996,"Ġ68":997,"Ġ187":998,"sium":999,"Ġ21":1000,"914":1001,"952":1002,"Ġ620":1003,"Ġ1020":1004,"Ġ350":1005,"Ġ900":1006,"986":1007,"Ġ1512":1008,"142":1009,"Ġ540":1010,"Magne":1011,"108":1012,"304":1013,"Magnesium":1014,"27":1015,"35":1016,"99":1017,"Ġ17":1018,"Ġ157":1019,"Ġ196":1020,"Ġ170":1021,"Ġ214":1022,"Ġ855":1023,"Ġ860":1024,"Ġ814":1025,"Ġ56":1026,"Ġ500":1027,"Ġ520":1028,"Ġ980":1029,"Ġ320":1030,"Ġ1120":1031,"Ġ1150":1032,"Ġ1300":1033,"Ġ1373":1034,"Ġ586":1035,"Ġ1260":1036,"Ġ404":1037,"Ġ556":1038,"Ġ230":1039,"153":1040,"103":1041,"Ġ1115":1042,"08":1043,"053":1044,"042":1045,"18":1046,"125":1047,"36":1048,"39":1049,"375":1050,"44":1051,"51":1052,"56":1053,"59":1054,"66":1055,"625":1056,"76":1057,"79":1058,"81":1059,"Re":1060,"Ġ90":1061,"ĠRe":1062,"Ġ122":1063,"Ġ152":1064,"Ġ155":1065,"Ġ177":1066,"Ġ295":1067,"Ġ298":1068,"Ġ46":1069,"Ġ494":1070,"Ġ462":1071,"Ġ796":1072,"Ġ80":1073,"Ġ890":1074,"Ġ875":1075,"Ġ834":1076,"Ġ842":1077,"Ġ590":1078,"Ġ594":1079,"Ġ560":1080,"Ġ640":1081,"Ġ627":1082,"Ġ1045":1083,"Ġ1071":1084,"Ġ1603":1085,"875":1086,"Ġ368":1087,"Ġ378":1088,"Ġ375":1089,"Ġ330":1090,"Ġ356":1091,"Ġ240":1092,"Ġ243":1093,"Ġ220":1094,"Ġ225":1095,"Ġ1841":1096,"Ġ996":1097,"Ġ930":1098,"Ġ940":1099,"Ġ1370":1100,"Ġ1343":1101,"Ġ274":1102,"Ġ1058":1103,"Ġ929":1104,"Ġ1290":1105,"Ġ1250":1106,"Ġ1253":1107,"556":1108,"Ġ735":1109,"Ġ280":1110,"Ġ405":1111,"Ġ150":1112,"Ġ158":1113,"Ġ159":1114,"Ġ1515":1115,"Ġ421":1116,"Ġ506":1117,"Ġ548":1118,"Ġ1005":1119,"Ġ1007":1120,"Ġ740":1121,"Ġ1301":1122,"Ġ635":1123,"Ġ659":1124,"Ġ685":1125,"Ġ1719":1126,"Ġ1575":1127,"Ġ1965":1128,"Ġ564":1129,"083":1130}